Revit 2026 API

# AnalysisDisplayLegendSettingsRounding Property

---

Rounding increment for numeric values of analysis results.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Rounding { get; set; }
```
```vb
Public Property Rounding As Double
	Get
	Set
```
```cpp
public:
property double Rounding {
	double get ();
	void set (double value);
}
```
```fsharp
member Rounding : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentsInconsistentException | When setting this property: rounding is not positive |

#### Reference

AnalysisDisplayLegendSettings Class

Autodesk.Revit.DB.Analysis Namespace